In [1]:
import pandas as pd
import os
from dotenv import load_dotenv

In [2]:
load_dotenv()
all_stocks_data_path = os.getenv('ALL_STOCKS_5YRS_FILE_PATH')

In [3]:
data = pd.read_csv(all_stocks_data_path)

In [4]:
data.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [5]:
data.drop(columns=['open', 'high', 'low', 'volume'], axis=1, inplace=True)

In [6]:
data.head()

         date  close Name
0  2013-02-08  14.75  AAL
1  2013-02-11  14.46  AAL
2  2013-02-12  14.27  AAL
3  2013-02-13  14.66  AAL
4  2013-02-14  13.99  AAL

In [7]:
len(data['Name'].unique())

505

In [8]:
data['date'] = pd.to_datetime(data['date'])

In [9]:
data.head()

        date  close Name
0 2013-02-08  14.75  AAL
1 2013-02-11  14.46  AAL
2 2013-02-12  14.27  AAL
3 2013-02-13  14.66  AAL
4 2013-02-14  13.99  AAL

In [10]:
data['returns'] = data.groupby('Name')['close'].pct_change()

In [11]:
data.isna().sum()

date         0
close        0
Name         0
returns    505
dtype: int64

In [12]:
data.dropna(inplace=True)

In [13]:
data.isna().sum().sum()

0

In [14]:
import numpy as np
data['log_returns'] = data.groupby('Name')['close'].transform(lambda x: np.log(x/x.shift(1)))

In [15]:
data.head()

        date  close Name   returns  log_returns
1 2013-02-11  14.46  AAL -0.019661          NaN
2 2013-02-12  14.27  AAL -0.013140    -0.013227
3 2013-02-13  14.66  AAL  0.027330     0.026963
4 2013-02-14  13.99  AAL -0.045703    -0.046780
5 2013-02-15  14.50  AAL  0.036455     0.035806

In [16]:
data.isna().sum()

date             0
close            0
Name             0
returns          0
log_returns    505
dtype: int64

In [17]:
data.dropna(inplace=True)

In [18]:
data.head(50)

         date  close Name   returns  log_returns
2  2013-02-12  14.27  AAL -0.013140    -0.013227
3  2013-02-13  14.66  AAL  0.027330     0.026963
4  2013-02-14  13.99  AAL -0.045703    -0.046780
5  2013-02-15  14.50  AAL  0.036455     0.035806
6  2013-02-19  14.26  AAL -0.016552    -0.016690
7  2013-02-20  13.33  AAL -0.065217    -0.067441
8  2013-02-21  13.37  AAL  0.003001     0.002996
9  2013-02-22  13.57  AAL  0.014959     0.014848
10 2013-02-25  13.02  AAL -0.040531    -0.041375
11 2013-02-26  13.26  AAL  0.018433     0.018265
12 2013-02-27  13.41  AAL  0.011312     0.011249
13 2013-02-28  13.43  AAL  0.001491     0.001490
14 2013-03-01  13.61  AAL  0.013403     0.013314
15 2013-03-04  13.90  AAL  0.021308     0.021084
16 2013-03-05  14.05  AAL  0.010791     0.010734
17 2013-03-06  14.57  AAL  0.037011     0.036342
18 2013-03-07  14.82  AAL  0.017159     0.017013
19 2013-03-08  14.92  AAL  0.006748     0.006725
20 2013-03-11  15.13  AAL  0.014075     0.013977
21 2013-03-12  15.50  AAL  0.024455     0.024160
22 2013-03-13  15.91  AAL  0.026452     0.026108
23 2013-03-14  16.25  AAL  0.021370     0.021145
24 2013-03-15  15.98  AAL -0.016615    -0.016755
25 2013-03-18  16.29  AAL  0.019399     0.019213
26 2013-03-19  16.78  AAL  0.030080     0.029636
27 2013-03-20  17.23  AAL  0.026818     0.026464
28 2013-03-21  17.00  AAL -0.013349    -0.013439
29 2013-03-22  16.86  AAL -0.008235    -0.008269
30 2013-03-25  16.60  AAL -0.015421    -0.015541
31 2013-03-26  16.51  AAL -0.005422    -0.005436
32 2013-03-27  16.65  AAL  0.008480     0.008444
33 2013-03-28  16.97  AAL  0.019219     0.019037
34 2013-04-01  16.67  AAL -0.017678    -0.017836
35 2013-04-02  15.74  AAL -0.055789    -0.057405
36 2013-04-03  15.53  AAL -0.013342    -0.013432
37 2013-04-04  15.69  AAL  0.010303     0.010250
38 2013-04-05  15.72  AAL  0.001912     0.001910
39 2013-04-08  15.84  AAL  0.007634     0.007605
40 2013-04-09  15.70  AAL -0.008838    -0.008878
41 2013-04-10  15.78  AAL  0.005096     0.005083
42 2013-04-11  16.19  AAL  0.025982     0.025650
43 2013-04-12  16.14  AAL -0.003088    -0.003093
44 2013-04-15  15.59  AAL -0.034077    -0.034671
45 2013-04-16  16.37  AAL  0.050032     0.048821
46 2013-04-17  16.52  AAL  0.009163     0.009121
47 2013-04-18  16.10  AAL -0.025424    -0.025752
48 2013-04-19  16.02  AAL -0.004969    -0.004981
49 2013-04-22  15.52  AAL -0.031211    -0.031708
50 2013-04-23  16.30  AAL  0.050258     0.049036
51 2013-04-24  16.45  AAL  0.009202     0.009160

In [19]:
data.reset_index(drop=True, inplace=True)

In [20]:
data.head()

        date  close Name   returns  log_returns
0 2013-02-12  14.27  AAL -0.013140    -0.013227
1 2013-02-13  14.66  AAL  0.027330     0.026963
2 2013-02-14  13.99  AAL -0.045703    -0.046780
3 2013-02-15  14.50  AAL  0.036455     0.035806
4 2013-02-19  14.26  AAL -0.016552    -0.016690

In [21]:
load_dotenv()
folder_path = os.getenv('DATASETS_FOLDER_PATH')

In [22]:
csv_filename = 'stock_returns_5yr.csv'

csv_path = os.path.join(folder_path, csv_filename)

data.to_csv(csv_path, index=False)